# Заданние 11
from utils import scalar_mult_mod

# Исходные данные
p = 41
a = 11
b = 20
n = 225
P2 = (20, 9)

print("=== Задание 11 ===")
R = scalar_mult_mod(n, P2, a, b, p)
if R is None:
    print(f"{n}·P2 = точка на бесконечности (нейтральный элемент)")
    print("Точка на бесконечности принадлежит кривой по определению.")
else:
    print(f"{n}·P2 = ({R[0]}, {R[1]})")
    # Проверка принадлежности
    lhs = (R[1] * R[1]) % p
    rhs = (R[0]**3 + a*R[0] + b) % p
    on = (lhs == rhs)
    print(f"Точка {n}·P2 {'принадлежит' if on else 'НЕ принадлежит'} кривой")