# Задание 7

# Исходные данные
p = 41
a = 11
b = 20

print("=== Задание 7 ===")
print(f"Уравнение над GF({p}): y^2 = x^3 + {a}·x + {b} (mod {p})")

# Проверка особенности над полем
delta_mod = (4 * a**3 + 27 * b**2) % p
print(f"Дискриминант Δ mod {p} = {delta_mod}")
if delta_mod != 0:
    print("   Δ ≠ 0 mod p → кривая неособая над GF(p).")
else:
    print("   Δ = 0 mod p → кривая особая над GF(p).")